OpenFOAM/simpleFsi-OF4.1/cases/main-les-long-SBRS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
	type		nutkWallFunction;
	value		$internalField;
    }

    inlet
    {
        type            calculated;
        value		$internalField;
    }

    outlet
    {
	type		zeroGradient;
    }

    channel
    {
	type		nutkWallFunction;
	value		$internalField;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
